https://www.datacamp.com/community/tutorials/python-lambda?utm_source=adwords_ppc&utm_campaignid=1455363063&utm_adgroupid=65083631748&utm_device=c&utm_keyword=&utm_matchtype=b&utm_network=g&utm_adpostion=&utm_creative=278443377092&utm_targetid=aud-392016246653:dsa-429603003980&utm_loc_interest_ms=&utm_loc_physical_ms=1012040&gclid=Cj0KCQjwpf2IBhDkARIsAGVo0D1J_XsYxPX_EcLVNEet6t14a8DhEnehWqi0-qaT1UAnTjegz0OYbwYaAn6-EALw_wcB

In [1]:
raise_to_power = lambda x, y: x ** y

raise_to_power(2, 3)

8

In [3]:
nums = [48, 6, 9, 21, 1]

square_all = map(lambda num: num ** 2, nums)

print(square_all)

print(list(square_all))

<map object at 0x000001DE77046D60>
[2304, 36, 81, 441, 1]

In [5]:
# def echo_word(word1, echo):
#     """Concatenate echo copies of word1."""
#     words = word1 * echo
#     return words

# Define echo_word as a lambda function: echo_word
echo_word = (lambda word1, echo: word1 * echo)

# Call echo_word: result
result = echo_word('hey', 5)

# Print result
print(result)

heyheyheyheyhey

https://www.w3schools.com/python/python_lambda.asp

In [7]:
x = lambda a : a + 10
print(x(5))

15

In [8]:
x = lambda a, b : a * b
print(x(5, 6))

30

In [9]:
x = lambda a, b, c : a + b + c
print(x(5, 6, 2))

13

def myfunc(n):
    return lambda a : a * n

mydoubler = myfunc(2)

print(mydoubler(11))

In [11]:
def myfunc(n):
    return lambda a : a * n

mytripler = myfunc(3)

print(mytripler(11))

33

In [12]:
def myfunc(n):
    return lambda a : a * n

mydoubler = myfunc(2)
mytripler = myfunc(3)

print(mydoubler(11))
print(mytripler(11))

22
33

https://realpython.com/python-lambda/

In [15]:
(lambda x: x + 1)(2)

3

In [17]:
add_one = lambda x: x + 1

add_one(2)

3

In [18]:
full_name = lambda first, last: f'Full name: {first.title()} {last.title()}'
full_name('guido', 'van rossum')

'Full name: Guido Van Rossum'

In [19]:
(lambda x, y: x + y)(2, 3)

5

In [20]:
high_ord_func = lambda x, func: x + func(x)

high_ord_func(2, lambda x: x * x)

6

In [21]:
high_ord_func(2, lambda x: x + 3)

7

In [24]:
list(map(lambda x: x.capitalize(), 
         ['cat', 'dog', 'cow'])
    )
# list(map(lambda x: x.capitalize(), ['cat', 'dog', 'cow']))

['Cat', 'Dog', 'Cow']

https://towardsdatascience.com/lambda-functions-with-practical-examples-in-python-45934f3653a8

In [25]:
(lambda x: x*2)(12)

24

In [27]:
list_1 = [1,2,3,4,5,6,7,8,9]

print(filter(lambda x: x%2==0, list_1))
print(list(filter(lambda x: x%2==0, list_1)))

<filter object at 0x000001DE7708DC10>
[2, 4, 6, 8]

In [28]:
list_1 = [1,2,3,4,5,6,7,8,9]
cubed = map(lambda x: pow(x,3), list_1)

list(cubed)

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [29]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['Luke','Gina','Sam','Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016],
})

df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

In [31]:
df['age'] = df['Birthyear'].apply(lambda x: 2021-x)
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

In [34]:
print(list(filter(lambda x: x>18, df['age'])))
print(filter(lambda x: x>18, df['age']))
df

[45, 37]
<filter object at 0x000001DE1712DD30>

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

In [35]:
#Double the age of everyone
df['double_age'] = df['age'].map(lambda x: x*2)
df

   Name    Status  Birthyear  age  double_age
0  Luke    Father       1976   45          90
1  Gina    Mother       1984   37          74
2   Sam       Son       2013    8          16
3  Emma  Daughter       2016    5          10

In [37]:
#Conditional Lambda statement
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')
df

   Name    Status  Birthyear  age  double_age  Gender
0  Luke    Father       1976   45          90    Male
1  Gina    Mother       1984   37          74  Female
2   Sam       Son       2013    8          16    Male
3  Emma  Daughter       2016    5          10  Female

In [38]:
 #convert to lower-case
df[['Name','Status']] = df.apply(lambda x: x[['Name','Status']].str.lower(), axis=1)
df

   Name    Status  Birthyear  age  double_age  Gender
0  luke    father       1976   45          90    Male
1  gina    mother       1984   37          74  Female
2   sam       son       2013    8          16    Male
3  emma  daughter       2016    5          10  Female